import random

print("Вітаю на чатботі!"
      "Назовіть своє імя.")
name = input("Введіть ім'я: ")
print('Вітаю', name, '''\nВиберіть уподобання:\n\tc Кіно\n\tm Музика \n\tp Ігри\n\t0 Вихід\n''')

c = {'Драма': 'Дике поле, Донбас, Дике поле', 'Комедія': 'Ескорт, Липучка, Пропозиція', 'Жахи': 'Веном, Аквапарк, Вони'}
m = {'Рок': 'Мураками, Скорпіонс, Ьеталіка', 'Класика': 'Бах, Бетховен, Моцарт', 'Джаз': 'Боб Зоп, Бені Харіс, Джим БІл'}

while True:
      choice = input('Виберіть уподобання: ')
      if choice == 'c':
            print(c)
            c_ganr = input('''\nОберіть жанр кіно:\n\tdr Драма\n\tk Комедія \n\th Жахи\n\t0 Назад\n''')
            print(c)
      elif choice == 'm':
            print(m)
            m_ganr = input('''\nОберіть  музи жанр :\n\tr Рок\n\tcl ККласика \n\tj Джаз\n\t0 Назад\n''')
      elif choice == 'p':
            number = random.randint(1, 100)
            print('Давайте пограємо в гру, ви повинні вгадати моє число в діапазоні 0-10 з 3 спроб')



      elif choice == 0:
            print('exit')
      break
